Terraform plan for __ibo__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.secret_mgr_service_account_iam[0] will be created
  + resource "google_project_iam_member" "secret_mgr_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/secretmanager.admin"
    }

  # google_service_account.secret_mgr_service_account will be created
  + resource "google_service_account" "secret_mgr_service_account" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "Service account for core credentials service"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.secret_mgr_service_account will be created
  + resource "google_service_account_iam_member" "secret_mgr_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ibo-prod.svc.id.goog[api-creds/api-credentials]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # kubernetes_namespace.gke_namespace_api_creds will be created
  + resource "kubernetes_namespace" "gke_namespace_api_creds" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "api-creds"
            }
          + generation       = (known after apply)
          + labels           = {
              + "project" = "ibo-prod"
            }
          + name             = "api-creds"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.secret_mgr_service_account will be created
  + resource "kubernetes_service_account" "secret_mgr_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "api-credentials"
          + namespace        = "api-creds"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #369](https://github.com/ebomart/commerce-infrastructure/actions/runs/1625914207)